# 1. Напишите программу, которая принимает список чисел и возвращает список квадратов этих чисел.

# 2. Напишите программу, которая принимает на вход список строк и возвращает список строк,
# длина которых больше 5 символов.

# 3. Напишите программу, которая принимает на вход список чисел и возвращает только четные
# числа из этого списка.

# 4. Напишите программу, которая принимает на вход список чисел и возвращает сумму квадратов
# четных чисел из этого списка.

# 5. Напишите программу, которая принимает на вход список строк и возвращает список строк,
# которые начинаются с буквы "b".

# 6. Напишите программу, которая принимает на вход список чисел и возвращает список чисел,
# которые больше 10 и меньше 20.

# 7. Напишите функцию, которая принимает на вход список чисел и возвращает True, если все
# числа в списке положительные, и False в противном случае.

# 8. Напишите функцию, которая принимает на вход список строк и возвращает список строк,
# которые содержат только цифры.