
# 1. Напишите программу, которая будет принимать слово и определять,
# является ли оно палиндромом.



# 2. Даны два словаря: dictionary_1 = {'a': 300, 'b': 400} и dictionary_2 = {'c': 500, 'd': 600}.
# Объедините их в один при помощи встроенных функций языка Python.

#  3. Напишите программу, которая определяет, состоит ли двузначное число,
# введенное с клавиатуры из одинаковых цифр. Если состоит, то программа выведет
# «Да, это число <вывести число>», в противном случае выведет «Нет».

# 4. Напишите программу, которая просит пользователя что-нибудь ввести с клавиатуры.
# Если он вводит какие-нибудь данные, то на экране должно выводиться сообщение True.
# Если он не вводит данные, а просто нажимает Enter, то программа выводит False.

# 5. Напишите программа, которая будет определять, является ли год високосным.

# 6. Напишите программу, которая принимает три числа, определить, возможен ли треугольник с такими сторонами.